
https://github.com/rlister/org-present
https://github.com/eschulte/epresent
http://sachachua.com/blog/2013/04/how-to-present-using-org-mode-in-emacs/
https://github.com/yjwen/org-reveal
https://github.com/takaxp/org-tree-slide/
https://github.com/tucasp/org-presie

http://orgmode.org/worg/exporters/beamer/tutorial.html
http://orgmode.org/worg/org-tutorials/non-beamer-presentations.html#sec-3

** Code blocks should be runnable and editable			      :slide:

#+BEGIN_SRC python
print 6 + 6
#+END_SRC

#+RESULTS:
: 12

They are.
** We can use many languages 					      :slide:
(of course, you must have them installed on your computer)

#+BEGIN_SRC emacs-lisp
(+ 6 6)
#+END_SRC

#+RESULTS:
: 12


#+BEGIN_SRC R 
sum(c(6, 6))
#+END_SRC

#+RESULTS:
: [1] 12


#+BEGIN_SRC perl :results output
print 6 + 6
#+END_SRC

#+RESULTS:
: 12


#+BEGIN_SRC ruby
print 6 + 6
#+END_SRC


#+BEGIN_SRC matlab
% Sadly only on Mac and Linux. That's a deal breaker...
#+END_SRC
** Starting the show
We need some functions for convenient starting and stopping.

On starting, we want to map the slides so we can get slide numbers for navigation and to display them on the frame. We also make the slide tags invisible. We set some temporary key bindings. These need to be global because sometimes we navigate out of the slideshow buffer, and we want page up and down to go to the next slides no matter where we are.


#+BEGIN_SRC emacs-lisp :results raw
(setq  sacha/org-show-key-bindings
       `((,[f6]    ,(key-binding '[f6])       'sacha/org-show-execute-slide)
         (,[next]  ,(key-binding '[next])     'sacha/org-show-next-slide)
	 (,[prior] ,(key-binding '[previous]) 'sacha/org-show-previous-slide)))

(global-set-key (nth 0 (car sacha/org-show-key-bindings)) (nth 2 (car sacha/org-show-key-bindings)))
#+END_SRC

#+RESULTS:
(quote sacha/org-show-execute-slide)
(quote sacha/org-show-execute-slide)
quote
flyspell-check-next-highlighted-word
flyspell-check-next-highlighted-word
((quote [f6]) flyspell-check-next-highlighted-word quote sacha/org-show-execute-slide)
(((quote [f6]) flyspell-check-next-highlighted-word quote sacha/org-show-execute-slide) ((quote [next]) scroll-up-command quote sacha/org-show-next-slide) ((quote [prior]) nil quote sacha/org-show-previous-slide))

#+BEGIN_SRC emacs-lisp :tangle org-show.el
(defvar sacha/org-show-slide-list '() "List of slide numbers and markers to each slide")
(defvar sacha/org-show-slide-titles '() "List of titles and slide numbers for each slide")
(defvar sacha/org-show-key-bindings
  `((,[f6]    ,(key-binding '[f6])       sacha/org-show-execute-slide)
    (,[next]  ,(key-binding '[next])     sacha/org-show-next-slide)
    (,[prior] ,(key-binding '[prior])    sacha/org-show-previous-slide))
  "list of keys, original binding and new temporary binding")

(defun sacha/org-show-start ()
  (interactive)
  
  (setq sacha/org-show-presentation-file (expand-file-name (buffer-name)))
  
  ;; make slide list for future navigation
  (let ((n 0))
    (org-map-entries
     (lambda ()
       (when (string-match-p ":slide:" (or (nth 5 (org-heading-components)) ""))
	 (setq n (+ n 1))
         
	 (add-to-list 'sacha/org-show-slide-titles 
		      (cons (nth 4 (org-heading-components)) n) t)

	 (add-to-list 'sacha/org-show-slide-list 
		      (cons n (set-marker (make-marker) (point))) t)))))

  ;; hide slide tags
  (save-excursion
  (while (re-search-forward ":slide:" nil t)
    (overlay-put
     (make-overlay (match-beginning 0)(match-end 0))
     'invisible 'slide)))
  (add-to-invisibility-spec 'slide)

  (beginning-of-buffer)
  (delete-other-windows)
  ;; temporary key-bindings. these are undone in stop
  (mapcar (lambda (x)
	    (let ((key (nth 0 x))
		  (new-binding (nth 2 x)))
	      (global-set-key key new-binding))) sacha/org-show-key-bindings)
  (sacha/org-show-next-slide))

(defalias 'start 'sacha/org-show-start)
#+END_SRC

** Table of contents
#+BEGIN_SRC emacs-lisp
(defun sacha/org-show-toc ()
  (interactive)
  (let ((links) (c-b (buffer-name)) (n))
    (save-excursion
      (mapcar
       (lambda (x)
	 (setq n (car x))
	 (goto-char (cdr x))
	 (add-to-list
	  'links
	  (format "[[elisp:(progn (switch-to-buffer \"%s\")(goto-char %s)(sacha/org-show-execute-slide))][%s]] %s\n"
		  (marker-buffer (cdr x))
		  (marker-position (cdr x))
		  (car x)
		  (nth 4 (org-heading-components))) t))
	      sacha/org-show-slide-list))

    
    (switch-to-buffer "*List of Slides*")
    (org-mode)
    (erase-buffer)
    
    (insert (mapconcat 'identity links ""))
  
    ;(setq buffer-read-only t)
    (use-local-map (copy-keymap org-mode-map))
    (local-set-key "q" #'(lambda () (interactive) (kill-buffer)))))

(sacha/org-show-toc)
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (kill-buffer) |

